---
kind: type
id: T:Autodesk.Revit.DB.ProjectLocationSetIterator
source: html/ab766dbe-0b3a-908a-d952-2b1974584823.htm
---
# Autodesk.Revit.DB.ProjectLocationSetIterator

An iterator to a project location set.

## Syntax (C#)
```csharp
public abstract class ProjectLocationSetIterator : APIObject,
	IEnumerator
```